MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6013/mcu.h
#define _IPC9_INT4IP_POSITION                    0x00000004
#define _IPC9_INT4IP_MASK                        0x00000070
#define _IPC9_INT4IP_LENGTH                      0x00000003

#define _IPC9_C2IP_POSITION                      0x00000008
#define _IPC9_C2IP_MASK                          0x00000700
#define _IPC9_C2IP_LENGTH                        0x00000003

#define _IPC9_INT3IP0_POSITION                   0x00000000
#define _IPC9_INT3IP0_MASK                       0x00000001
#define _IPC9_INT3IP0_LENGTH                     0x00000001

#define _IPC9_INT3IP1_POSITION                   0x00000001
#define _IPC9_INT3IP1_MASK                       0x00000002
#define _IPC9_INT3IP1_LENGTH                     0x00000001

#define _IPC9_INT3IP2_POSITION                   0x00000002
#define _IPC9_INT3IP2_MASK                       0x00000004
#define _IPC9_INT3IP2_LENGTH                     0x00000001

#define _IPC9_INT4IP0_POSITION                   0x00000004
#define _IPC9_INT4IP0_MASK                       0x00000010
#define _IPC9_INT4IP0_LENGTH                     0x00000001

#define _IPC9_INT4IP1_POSITION                   0x00000005
#define _IPC9_INT4IP1_MASK                       0x00000020
#define _IPC9_INT4IP1_LENGTH                     0x00000001

#define _IPC9_INT4IP2_POSITION                   0x00000006
#define _IPC9_INT4IP2_MASK                       0x00000040
#define _IPC9_INT4IP2_LENGTH                     0x00000001

#define _IPC9_C2IP0_POSITION                     0x00000008
#define _IPC9_C2IP0_MASK                         0x00000100
#define _IPC9_C2IP0_LENGTH                       0x00000001

#define _IPC9_C2IP1_POSITION                     0x00000009
#define _IPC9_C2IP1_MASK                         0x00000200
#define _IPC9_C2IP1_LENGTH                       0x00000001

#define _IPC9_C2IP2_POSITION                     0x0000000A
#define _IPC9_C2IP2_MASK                         0x00000400
#define _IPC9_C2IP2_LENGTH                       0x00000001

#define _IPC10_LVDIP_POSITION                    0x00000008
#define _IPC10_LVDIP_MASK                        0x00000700
#define _IPC10_LVDIP_LENGTH                      0x00000003

#define _IPC10_LVDIP0_POSITION                   0x00000008
#define _IPC10_LVDIP0_MASK                       0x00000100
#define _IPC10_LVDIP0_LENGTH                     0x00000001

#define _IPC10_LVDIP1_POSITION                   0x00000009
#define _IPC10_LVDIP1_MASK                       0x00000200
#define _IPC10_LVDIP1_LENGTH                     0x00000001

#define _IPC10_LVDIP2_POSITION                   0x0000000A
#define _IPC10_LVDIP2_MASK                       0x00000400
#define _IPC10_LVDIP2_LENGTH                     0x00000001

#define _INTTREG_VECNUM_POSITION                 0x00000000
#define _INTTREG_VECNUM_MASK                     0x0000003F
#define _INTTREG_VECNUM_LENGTH                   0x00000006

#define _INTTREG_ILR_POSITION                    0x00000008
#define _INTTREG_ILR_MASK                        0x00000F00
#define _INTTREG_ILR_LENGTH                      0x00000004

#define _INTTREG_VHOLD_POSITION                  0x0000000D
#define _INTTREG_VHOLD_MASK                      0x00002000
#define _INTTREG_VHOLD_LENGTH                    0x00000001

#define _INTTREG_TMODE_POSITION                  0x0000000E
#define _INTTREG_TMODE_MASK                      0x00004000
#define _INTTREG_TMODE_LENGTH                    0x00000001

#define _INTTREG_IRQTOCPU_POSITION               0x0000000F
#define _INTTREG_IRQTOCPU_MASK                   0x00008000
#define _INTTREG_IRQTOCPU_LENGTH                 0x00000001

#define _INTTREG_VECNUM0_POSITION                0x00000000
#define _INTTREG_VECNUM0_MASK                    0x00000001
#define _INTTREG_VECNUM0_LENGTH                  0x00000001

#define _INTTREG_VECNUM1_POSITION                0x00000001
#define _INTTREG_VECNUM1_MASK                    0x00000002
#define _INTTREG_VECNUM1_LENGTH                  0x00000001

#define _INTTREG_VECNUM2_POSITION                0x00000002
#define _INTTREG_VECNUM2_MASK                    0x00000004
#define _INTTREG_VECNUM2_LENGTH                  0x00000001

#define _INTTREG_VECNUM3_POSITION                0x00000003
#define _INTTREG_VECNUM3_MASK                    0x00000008
#define _INTTREG_VECNUM3_LENGTH                  0x00000001

#define _INTTREG_VECNUM4_POSITION                0x00000004
#define _INTTREG_VECNUM4_MASK                    0x00000010
#define _INTTREG_VECNUM4_LENGTH                  0x00000001

#define _INTTREG_VECNUM5_POSITION                0x00000005
#define _INTTREG_VECNUM5_MASK                    0x00000020
#define _INTTREG_VECNUM5_LENGTH                  0x00000001

#define _INTTREG_ILR0_POSITION                   0x00000008
#define _INTTREG_ILR0_MASK                       0x00000100
#define _INTTREG_ILR0_LENGTH                     0x00000001

#define _INTTREG_ILR1_POSITION                   0x00000009
#define _INTTREG_ILR1_MASK                       0x00000200
#define _INTTREG_ILR1_LENGTH                     0x00000001

#define _INTTREG_ILR2_POSITION                   0x0000000A
#define _INTTREG_ILR2_MASK                       0x00000400
#define _INTTREG_ILR2_LENGTH                     0x00000001

#define _INTTREG_ILR3_POSITION                   0x0000000B
#define _INTTREG_ILR3_MASK                       0x00000800
#define _INTTREG_ILR3_LENGTH                     0x00000001

#define _CNEN1_CN0IE_POSITION                    0x00000000
#define _CNEN1_CN0IE_MASK                        0x00000001
#define _CNEN1_CN0IE_LENGTH                      0x00000001

#define _CNEN1_CN1IE_POSITION                    0x00000001
#define _CNEN1_CN1IE_MASK                        0x00000002
#define _CNEN1_CN1IE_LENGTH                      0x00000001

#define _CNEN1_CN2IE_POSITION                    0x00000002
#define _CNEN1_CN2IE_MASK                        0x00000004
#define _CNEN1_CN2IE_LENGTH                      0x00000001

#define _CNEN1_CN3IE_POSITION                    0x00000003
#define _CNEN1_CN3IE_MASK                        0x00000008
#define _CNEN1_CN3IE_LENGTH                      0x00000001

#define _CNEN1_CN4IE_POSITION                    0x00000004
#define _CNEN1_CN4IE_MASK                        0x00000010
#define _CNEN1_CN4IE_LENGTH                      0x00000001

#define _CNEN1_CN5IE_POSITION                    0x00000005
#define _CNEN1_CN5IE_MASK                        0x00000020
#define _CNEN1_CN5IE_LENGTH                      0x00000001

#define _CNEN1_CN6IE_POSITION                    0x00000006
#define _CNEN1_CN6IE_MASK                        0x00000040
#define _CNEN1_CN6IE_LENGTH                      0x00000001

#define _CNEN1_CN7IE_POSITION                    0x00000007
#define _CNEN1_CN7IE_MASK                        0x00000080
#define _CNEN1_CN7IE_LENGTH                      0x00000001

#define _CNEN1_CN8IE_POSITION                    0x00000008
#define _CNEN1_CN8IE_MASK                        0x00000100
#define _CNEN1_CN8IE_LENGTH                      0x00000001

#define _CNEN1_CN9IE_POSITION                    0x00000009
#define _CNEN1_CN9IE_MASK                        0x00000200
#define _CNEN1_CN9IE_LENGTH                      0x00000001

#define _CNEN1_CN10IE_POSITION                   0x0000000A
#define _CNEN1_CN10IE_MASK                       0x00000400
#define _CNEN1_CN10IE_LENGTH                     0x00000001

#define _CNEN1_CN11IE_POSITION                   0x0000000B
#define _CNEN1_CN11IE_MASK                       0x00000800
#define _CNEN1_CN11IE_LENGTH                     0x00000001

#define _CNEN1_CN12IE_POSITION                   0x0000000C
#define _CNEN1_CN12IE_MASK                       0x00001000
#define _CNEN1_CN12IE_LENGTH                     0x00000001

